var SAMARITAN = 0;
var UGARITIC = 1;
var HEBREW = 2;
var ARABIC = 3;
var PHOENICIAN = 4;
var ARAMAIC = 5;
var SYRIAC = 6;
var NABATEAN = 7;
var SOUTHARABIAN = 8;


var abjads = [
  ["ࠀ", "𐎀","א","ا","𐤀", "𐡀", "ܐ", "𐢁", "𐩱"],
  ["ࠁ", "𐎁","ב","ب","𐤁", "𐡁", "ܒ", "𐢃", "𐩨"],
  ["ࠂ", "𐎂","ג","ج","𐤂", "𐡂", "ܓ", "𐢄", "𐩴"],
  ["ࠇ", "𐎃","ח","خ","𐤇", "𐡇", "ܚ", "𐢊", "𐩢"],
  ["ࠂ", "𐎄","ד","د","𐤃", "𐡃", "ܕ", "𐢅", "𐩵"],
  ["ࠄ", "𐎅","ה","ه","𐤄", "𐡄", "ܗ", "𐢇", "𐩠"],
  ["ࠅ", "𐎆","ו","و","𐤅", "𐡅", "ܘ", "𐢈", "𐩥"],
  ["ࠆ", "𐎇","ז","ز","𐤆", "𐡆", "ܙ", "𐢉", "𐩸"],
  ["ࠇ", "𐎃","ח","ح","𐤇", "𐡇", "ܚ", "𐢊", "𐩢"],
  ["ࠈ", "𐎉","ט","ط","𐤈", "𐡈", "ܛ", "𐢋<200e>", "𐩷"],
  ["ࠉ", "𐎊","י","ي","𐤉", "𐡉", "ܝ", "𐢍", "𐩺"],
  ["ࠊ", "𐎋","כ","ك","𐤊", "𐡊", "ܟ", "𐢏", "𐩫"],
  ["ࠔ", "𐎌","ש","ش","𐤔", "𐡔", "ܫ", "𐢝", "𐩦"],
  ["ࠋ", "𐎍","ל","ل","𐤋", "𐡋", "ܠ", "𐢑", "𐩡"],
  ["ࠌ", "𐎎","מ","م","𐤌", "𐡌", "ܡ", "𐢓", "𐩣"],
  ["ࠃ", "𐎏","ד","ذ","𐤃", "𐡃", "ܕ" , "𐢅", "𐩹"],
  ["ࠍ", "𐎐","נ","ن","𐤍", "𐡍", "ܢ", "𐢕", "𐩬"],
  ["ࠈ", "𐎑","ט'","ظ","𐤈", "𐡈", "ܛ" , "𐢋", "𐩼"],
  ["ࠎ", "𐎒","ס","س","𐤎", "𐡎", "ܣ" , "𐢖", "𐩯"],
  ["ࠏ", "𐎓","ע","ع","𐤏", "𐡏", "ܥ" , "𐢗", "𐩲"],
  ["ࠐ", "𐎔","פ","ف","𐤐", "𐡐", "ܦ", "𐢘", "𐩰"],
  ["ࠑ", "𐎕","צ","ص","𐤑", "𐡑", "ܨ", "𐢙", "𐩮"],
  ["ࠑ", "𐎕","צ'","ض","𐤑", "𐡑", "ܨ", "𐢙", "𐩳"],
  ["ࠒ", "𐎖","ק","ق","𐤒", "𐡒", "ܩ", "𐢚", "𐩤"],
  ["ࠓ", "𐎗","ר","ر","𐤓", "𐡓", "ܪ", "𐢛", "𐩧"],
  ["ࠕ", "𐎘","ת'","ث","𐤕", "𐡕", "ܬ", "𐢞", "𐩻"],
  ["ࠏ", "𐎙","ע'","غ","𐤏", "𐡏", "ܥ", "𐢗", "𐩶"],
  ["ࠕ", "𐎚","ת","ت","𐤕", "𐡕", "ܬ", "𐢞", "𐩩"],
  ["ࠉ", "𐎛","אִ","ئ","𐤉", "𐡉", "ܝ", "𐢍", "𐩺"],
  ["ࠅ", "𐎜","אֻ","ؤ","𐤅", "𐡅", "ܘ", "𐢈", "𐩥"],
  ["ࠔ", "𐎝","שׂ","'س","𐤔", "𐡔", "ܫ", "𐢝", "𐩪"],
  [" ", "𐎟"," "," "," "," "," ", " ", " "]
]

var finals = [
  ["ࠍ", "𐎐","ן","ن","𐤍", "𐡍", "ܢ", "𐢔", "𐩬"],
  ["ࠌ", "𐎎","ם","م","𐤌", "𐡌", "ܡ", "𐢒", "𐩣"],
  ["ࠐ", "𐎔","ף","ف","𐤐", "𐡐", "ܦ", "𐢘", "𐩰"],
  ["ࠑ", "𐎕","ץ","ص","𐤑", "𐡑", "ܨ", "𐢙", "𐩮"],
  ["ࠊ", "𐎋","ך","ك","𐤊", "𐡊", "ܟ", "𐢎", "𐩫"],
];

function convert(str,source,dest) {
  /*
  str = str.replace(new RegExp('ם', 'g'), 'מ');
  str = str.replace(new RegExp('ן', 'g'), 'נ');
  str = str.replace(new RegExp('ף', 'g'), 'פ');
  str = str.replace(new RegExp('ץ', 'g'), 'צ');
  str = str.replace(new RegExp('ך', 'g'), 'כ');
  */
  abjads.map(x => str = str.replace(new RegExp(x[source],'g'),x[dest]));  
  finals.map(x => str = str.replace(new RegExp(x[source],'g'),x[dest]));  
  return str;
}

console.log(convert("שלום עולם",HEBREW,PHOENICIAN));

function load() {
  button = document.getElementById("convert");
  source = document.getElementById("source");
  from = document.getElementById("from");
  to = document.getElementById("to");
  output = document.getElementById("output");
  
  button.onclick = function() {
    output.innerHTML = convert(source.value, from.value, to.value);
  };
}


